{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_12/kernel", "shape": [7, 1, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6345627595396602, "scale": 0.004919091159222172, "original_dtype": "float32"}}, {"name": "conv1d_12/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5637883410734289, "scale": 0.004546680169947007, "original_dtype": "float32"}}, {"name": "batch_normalization_12/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.20496252179145813, "scale": 0.008904180222866582, "original_dtype": "float32"}}, {"name": "batch_normalization_12/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2836205533906525, "scale": 0.005454241411358703, "original_dtype": "float32"}}, {"name": "batch_normalization_12/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.012646651826798916, "scale": 0.004249219424730422, "original_dtype": "float32"}}, {"name": "batch_normalization_12/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.004203341901302338, "scale": 0.0016666485106243806, "original_dtype": "float32"}}, {"name": "conv1d_13/kernel", "shape": [7, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4591305732727051, "scale": 0.00953680113250134, "original_dtype": "float32"}}, {"name": "conv1d_13/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6955224448559331, "scale": 0.004189894246120079, "original_dtype": "float32"}}, {"name": "batch_normalization_13/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7640158534049988, "scale": 0.0019124309221903483, "original_dtype": "float32"}}, {"name": "batch_normalization_13/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4717811346054077, "scale": 0.0046253052412294875, "original_dtype": "float32"}}, {"name": "batch_normalization_13/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.122260093688965, "scale": 0.07073321996950636, "original_dtype": "float32"}}, {"name": "batch_normalization_13/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 32.79673767089844, "scale": 1.9526710061465993, "original_dtype": "float32"}}, {"name": "conv1d_14/kernel", "shape": [7, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3717085059951335, "scale": 0.0090841622913585, "original_dtype": "float32"}}, {"name": "conv1d_14/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7510388243724319, "scale": 0.0032512503219585794, "original_dtype": "float32"}}, {"name": "batch_normalization_14/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.754442036151886, "scale": 0.002393792423547483, "original_dtype": "float32"}}, {"name": "batch_normalization_14/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2949305218808791, "scale": 0.0036411175540849274, "original_dtype": "float32"}}, {"name": "batch_normalization_14/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.502955973148346, "scale": 0.013035203662573122, "original_dtype": "float32"}}, {"name": "batch_normalization_14/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.9805970191955566, "scale": 0.09299447115729836, "original_dtype": "float32"}}, {"name": "conv1d_15/kernel", "shape": [7, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1922850749071907, "scale": 0.008222655689015108, "original_dtype": "float32"}}, {"name": "conv1d_15/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8162544418783748, "scale": 0.004436165444991168, "original_dtype": "float32"}}, {"name": "batch_normalization_15/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.37137359380722046, "scale": 0.0014249317786272835, "original_dtype": "float32"}}, {"name": "batch_normalization_15/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.008382926695048809, "scale": 0.0007795275608990707, "original_dtype": "float32"}}, {"name": "batch_normalization_15/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7095801830291748, "scale": 0.016225813884361118, "original_dtype": "float32"}}, {"name": "batch_normalization_15/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 4.996621608734131, "scale": 0.11893197788911707, "original_dtype": "float32"}}, {"name": "dense_6/kernel", "shape": [192, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0982536937676224, "scale": 0.006995246457118614, "original_dtype": "float32"}}, {"name": "dense_6/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.44263409341082854, "scale": 0.0037831973795797312, "original_dtype": "float32"}}, {"name": "dense_7/kernel", "shape": [32, 14], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.186094017239178, "scale": 0.013913074311088113, "original_dtype": "float32"}}, {"name": "dense_7/bias", "shape": [14], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.969898125704597, "scale": 0.01499948548335655, "original_dtype": "float32"}}]}]}